Repository: common-repository/bucky-seo-tools
Catalog: languages/bucky-seo-*.po
Languages: es_co

source: https://osdeibi.dev/wp-plugin/bucky-seo
es_co: https://osdeibi.dev/wp-plugin/es/bucky-seo-tools

source: With just one click, you can download a comprehensive SEO report that identifies all of the common problems on your website.
es_co: Descarga en PDF el reporte SEO de tu sitio web e identifica todos los problemas comunes.

source: Download report
es_co: Descargar reporte

source: Site validator
es_co: Validador de sitio

source: Report executed on
es_co: Reporte aplicado a

source: Generated by
es_co: Generado por

source: Integration with Google Search Console
es_co: Verificación de integracion con Google Search Console

source: Your site is integrated with Google Search Console
es_co: ¡Felicidades! Tu sitio cuenta con verificación en Google Search Console

source: Your website doesn't have Google Search Console integrated. Integrating it is easy and free, and it will provide you with valuable insights about how people find your website on search results, show you which pages are indexed, and allow you to submit your sitemap.xml file.
es_co: No se encontro validacion para Google, es importante integrar Google Search Console para obtener metricas sobre intenciones de busqueda, ver estado de las paginas indexadas, hacer seguimiento del sitemap y entre otros beneficios de la herramienta. El esfuerzo de integracion es minimo y la herramienta es gratuita.

source: Bing Webmaster Tools verification
es_co: Verificación de Bing Webmaster Tools

source: Your site have integrated Bing webmaster Tools
es_co: El sitio cuenta con verificación en Bing Webmaster Tools

source: Bing Webmaster Tools is not enabled. Enabling it will allow Bing to crawl and index your website, potentially leading to faster discovery in search results.
es_co: No se encontró validación para Bing: Bing permite el rastreo, la indexación y el descubrimiento instantáneo del contenido de su sitio web en su motor de busqueda.

source: Yandex Webmaster Tools verification
es_co: Verificación de Yandex Webmaster Tools

source: This site have the Yandex Webmaster tools integrated
es_co: El sitio cuenta con verificación en Yandex Webmaster

source: Yandex verification wasn't found. Verifying your site ownership with Yandex Webmaster Tools provides tools for crawling, indexing, and analyzing your website's pages, along with a technical SEO health report.
es_co: No se encontró validación para Yandex: Yandex ofrece herramientas para rastrear y analizar la indexación de páginas del sitio, la clasificación de búsqueda y el estado técnico.

source: Search engine visibility
es_co: Visibilidad en los motores de búsqueda

source: Robots directive
es_co: Directivas de robots

source: Your site is not visible to search engines. This means it won't appear in search results.
es_co: Tu sitio está oculto para los robots rastreadores y NO se mostrara en los resultados de busqueda.

source: Actual configuration
es_co: La configuracion es

source: Your site is visible to search engines and will be included in search results.
es_co: Tu sitio no está oculto para los robots rastreadores y se mostrara en los resultados de busqueda.

source: Not found
es_co: No disponible

source: Seo title
es_co: Titulo SEO

source: The title is more than 60 characters and may not be fully visible in search results.
es_co: Sobrepasa el límite de 60 caracteres y posiblemente no sea visible completamente en los resultados de búsqueda.

source: Title
es_co: Título

source: The page's title has a good character count, ensuring it's both visible in search results and user-friendly.
es_co: Tienes un título para tu página principal, no sobrepasa el limite de caracteres y es visible, esto hara que en los resultados de busqueda sea entendible para los usuarios.

source: The page doesn't have a title. This can hurt your SEO, as it won't be displayed in search results.
es_co: No se encontró ningún título para la página principal. Esto es perjudicial para tu sitio, los usuarios no podran ver informacion en los resultados de busqueda.

source: SEO description
es_co: Descripción SEO

source: Your description exceeds 170 characters, the recommended limit for optimal display in search results. Consider shortening it to improve readability.
es_co: Sobrepasa el límite de 170 caracteres y posiblemente no sea visible completo en los resultados de búsqueda.

source: Description
es_co: Descripción

source: Great job with the descriptions! They're concise and user-friendly for search results.
es_co: Tienes una descripción para tu página principal, no sobrepasa el limite de caracteres y es visible, esto hara que en los resultados de busqueda sea entendible para los usuarios.

source: There is no description for your page. This can hurt users' experience, and your site might not appear with the correct description if you don't provide one.
es_co: No se encontró ningúna descripción para la página principal. Esto es perjudicial para tu sitio, los usuarios no podran ver informacion en los resultados de busqueda.

source: Keywords
es_co: Palabras claves

source: Total Keywords
es_co: Total de Palabras Claves

source: Your page doesn't have keywords assigned. Including relevant keywords can help search engines understand your content and improve your website's ranking.
es_co: No tienes palabras claves asignadas para tu página principal. Deberias asignar algunas para ayudar a los motores de busqueda a clasificar tu sitio.

source: Analytics
es_co: Analitica

source: Your site has duplicate Analytics scripts. Merging them or removing unused ones can improve performance and follow Google's recommendations.
es_co: Hay mas de 1 script de Google Analytics 4: Solo deberias tener 1 por recomendacion de Google si tiene más de una etiqueta instalada en su sitio web, puede optar por combinar sus etiquetas.

source: Your site have the correct integration with GA4
es_co: Tu sitio web cuenta con Google Analytics 4

source: Integrating Google Analytics 4 unlocks valuable insights into user behavior on your website. Consider setting it up to understand how visitors interact with your site.
es_co: Tu sitio web no cuenta con Google Analytics 4, deberias considerar integrarlo para tener datos sobre tu sitio web y las visitas.

source: Technical SEO
es_co: SEO técnico

source: Gzip compression
es_co: Compresión Gzip

source: The site have Gzip compression enabled
es_co: El sitio cuenta con compresión gzip habilitado.

source: Your website would benefit from Gzip compression. Enabling it reduces file sizes and improves loading speed.
es_co: La compresión Gzip es la más usada por ser compatible con la mayoría de navegadores.

source: Gzip compression is a method of compression and decompression that reduces the size of each file, improving website load and performance.
es_co: La compresión gzip es un método de compresión y descompresión que reduce el tamaño de los archivos web para acelerar la carga de los sitios web.

source: Your site have Cloudflare enabled
es_co: El sitio cuenta con Cloudflare

source: Cloudflare not enabled.
es_co: El sitio NO cuenta con Cloudflare

source: Cloudflare improves latency and performance. Utilizing the cache option can further accelerate your website's content delivery and potentially improve SEO.
es_co: Cloudflare elimina la latencia y mejorar el rendimiento. Activar el caché de Cloudflare acelera la entrega de contenido y mejora el SEO.

source: Total Iframes
es_co: Iframe totales

source: Iframes not found on the page
es_co: No se encontraron iframes en la página

source: iFrames don't affect SEO as much as you might think, Google still advises that you only use them when absolutely necessary.
es_co: Los iFrames no afectan el SEO tanto como podrías pensar, pero Google aún aconseja que los uses solo cuando sea absolutamente necesario.

source: Minified JS
es_co: Minificado CSS

source: Great! All your Javascript is minified
es_co: Excelente, tienes todos tus archivos JavaScript minificados.

source: Minified Javascripts
es_co: JavaScript minificados

source: Unminified Javascript
es_co: JavaScript NO minificados

source: Your website does not have any JavaScript files minified.
es_co: No existen archivos JavaScript minificados.

source: Minifying your JavaScript can significantly reduce its size (up to 40-70%), improving website loading speed.
es_co: Minificar tu código puede reducir el tamaño del archivo en un 40%. A veces incluso hasta en un 70%.

source: JS files without minify
es_co: JavaScript NO minificados

source: File type
es_co: Tipo de archivo

source: File
es_co: Archivo

source: Minified CSS
es_co: Archivos CSS minificados

source: Great! all your CSS are minified
es_co: Excelente, tienes todos tus archivos CSS minificados.

source: Minified CSS files
es_co: Archivos CSS minificados

source: CSS files without minify
es_co: Lista de JS sin minificar

source: Your website does not have any CSS files minified.
es_co: No existen archivos CSS minificados

source: Minifying your CSS can significantly reduce its size (up to 40-70%), improving website loading speed.
es_co: Minificar tu código puede reducir el tamaño del archivo en un 40%. A veces incluso hasta en un 70%.

source: CSS files without minification
es_co: Lista de CSS sin minificar

source: Stylesheet
es_co: Hojas de estilos

source: Next-Gen images
es_co: Imágenes de nueva generación

source: WebP image format excels at compression. This translates to smaller file sizes without sacrificing image quality, ultimately improving website loading speed.
es_co: Uno de los beneficios más destacados del uso de imágenes WebP es la compresión superior que mantiene una excelente calidad de imagen al tiempo que reduce significativamente el tamaño de los archivos.

source: WebP images are present on the page, but other formats like JPG and PNG are also used. Consider converting these images to WebP for better compression.
es_co: Tienes imágenes en formato webp, pero también hay imágenes en otros formatos como jpg, jpeg y/o png.

source: Page contains WebP images.
es_co: El sitio tiene imágenes en formato webp.

source: WebP images are not found on the page
es_co: Tu sitio web no cuenta con imágenes en formato webp.

source: Images that can be converted to WebP
es_co: Lista de imagenes que pueden ser convertidas a WebP

source: Content Analysis
es_co: Analisis de contenidos

source: Structured data
es_co: Datos Estructurados

source: Structured data is a way to provide search engines with additional information about a page, which can enhance search results with richer snippets.
es_co: Los resultados enriquecidos son mejoras visuales de los resultados de búsqueda tradicionales de Google.

source: Strucutred data on your page
es_co: Datos estructurados en tu sitio web

source: No structured data found.
es_co: Tu sitio web no cuenta con datos estructurados

source: Strucutred data not found
es_co: No hay datos estrucutrados para mostrar.

source: Hreflang is used for websites that offer content in multiple languages and regions. It helps search engines understand which version of your website is most relevant for a particular user's search query.
es_co: Hreflang se debe usar en cualquier sitio web que tenga múltiples versiones de páginas en diferentes idiomas o regiones.

source: Total Hrefland
es_co: Hreflang en la página

source: Hreflang not found
es_co: No se encontraron enlaces hreflang en la página

source: Language
es_co: Idioma

source: For best accessibility practices, it's recommended to use only one H1 tag per page to clearly define the main heading and improve screen reader navigation.
es_co: Tener muchas H1 no daña el SEO, pero es una mala práctica a nivel de accesibilidad tenerlas repetidas.

source: Total of H1 tags
es_co: Titulos H1 en la página

source: H1 tags not found
es_co: No hay etiquetas H1 para mostrar.

source: Canonical tags
es_co: Enlaces canonical en la página

source: Canonical tags not found
es_co: No hay enlaces canonical para mostrar

source: Viewport is an HTML5 meta tag that defines the viewport's dimensions, which is the user's visible area of the webpage on their device.
es_co: El viewport es una etiqueta meta de HTML5 que indica el tamaño de la ventana o área visible

source: For optimal user experience across devices, consider configuring a viewport meta tag to define the visible area of your webpage.
es_co: El viewport es una etiqueta meta de HTML5 que indica el tamaño de la ventana o área visible

source: Viewport not found
es_co: No se encontró contenido de viewport

source: Accelerated Mobile Pages (AMP) can significantly improve the loading speed of your website on mobile devices. Consider implementing AMP to enhance your mobile user experience.
es_co: Las siglas AMP provienen del término Accelerated Mobile Pages

source: AMP pages
es_co: Versiones AMP en la página

source: AMP pages not found
es_co: No se encontraron paginas AMP

source: AMP not found
es_co: No hay AMP para mostrar

source: Wordpress analysis
es_co: Análisis de WordPress

source: SSL is a security protocol that encrypts communication between browsers and websites.
es_co: SSL es una tecnología estandarizada que permite cifrar el tráfico de datos entre un navegador web y un sitio web (o entre dos servidores web), protegiendo así la conexión.

source: This site has SSL enabled and uses HTTPS
es_co: El sitio cuenta con certificado SSL activo y HTTPS activado.

source: This site lacks SSL encryption and HTTPS is not enabled. These technologies are crucial for securing communication between your website and users. Consider enabling them to protect user data and improve trust.
es_co: El sitio NO cuenta con certificado SSL activo y HTTPS activado

source: Wordpress version
es_co: Versión de Wordpress

source: Keeping WordPress updated is essential, just like any other software. This ensures you benefit from new features, improved performance, and the latest bug fixes.
es_co: Al igual que con cualquier otro tipo de software, actualizar WordPress a la última versión garantiza que los usuarios de la dicha plataforma podamos mejorar nuestros sitios con las nuevas funciones, mejoras y correcciones de errores

source: Actual version of Wordpress
es_co: Versión actual de WordPress

source: Most recent version of Wordpress
es_co: Versión mas reciente de WordPress

source: Your version is up to date
es_co: La versión de WordPress está actualizada

source: For optimal performance and security, consider updating to the latest version.
es_co: La versión de WordPress no está actualizada a la ultima version

source: Total installation size
es_co: Tamaño total de la instalación

source: Larger files take longer to load due to increased data transfer. Additionally, they consume more server storage space
es_co: Cuanto más pese más tardará de cargar ese archivo y por supuesto también tienes que tener en cuenta que esos archivos ocupan espacio en el servidor y cuanto más pesen mas espacio ocupan.

source: Size installation
es_co: Peso total de la instalación de WordPress

source: Active theme
es_co: Tema activo

source: In terms of SEO, there's no single 'best' WordPress theme. However, a modern theme that follows accessibility best practices, SEO guidelines, and utilizes lightweight frameworks can significantly benefit your website's search ranking and user experience.
es_co: No hay un tema mejor para SEO que otro para Wordpress, la importancia del tema radica en que sea moderno y use las mejores practicas en accesibilidad, directicas y frameworks livianos

source: There is not active theme
es_co: Nombre del tema activo

source: Inactive plugins, though seemingly harmless, are still executable files. This means they could be compromised during a hacking attempt, potentially allowing malware installation on your site. To minimize this risk, it's recommended to delete any inactive plugins you won't be using as a WordPress security best practice.
es_co: Los plugins inactivos pueden ser inofensivos, pero siguen siendo archivos ejecutables. En caso de intento de pirateo, estos archivos pueden infectarse o utilizarse para instalar malware en su sitio. Como precaución de seguridad de WordPress, deberías borrar cualquier plugin inactivo que no vayas a utilizar.

source: Active plugins
es_co: Plugins activos

source: Not active plugins
es_co: No hay plugins activos.

source: Inactive plugins
es_co: Plugins inactivos

source: Permalinks
es_co: Estructura de enlaces

source: A well-designed URL structure plays a crucial role in SEO. It helps search engines understand the hierarchy and content of your website, potentially improving your search ranking.
es_co: La estructura de una URL es fundamental para el SEO. Una URL bien diseñada comunica claramente el contenido

source: Day and name
es_co: Dia y nombre

source: Post name
es_co: Nombre de la entrada

source: Numeric
es_co: Numérico

source: Month and name
es_co: Mes y nombre

source: Custom structure
es_co: Personalizado

source: Permalinks not defined
es_co: La estructura de enlaces permanentes no está definida.

source: Permalinks not active
es_co: La estructura de enlaces permanentes no está activa.

source: Google Search Console can provide insights into search results and more.
es_co: Google Search Console sirve para obtener reportes de búsqueda, enviar sitemap y más.

source: Congratulations! Your site is verified with Google Search Console.
es_co: ¡Felicidades! Tu sitio cuenta con verificación en Google Search Console

source: Your site doesn't have Google Search Console verification.
es_co: No se encontro validacion para Google Search Console

source: https://osdeibi.dev/wp-plugin/en/site-validator/#google
es_co: https://osdeibi.dev/wp-plugin/es/validador-de-sitio/#google

source: Learn more about Google site verification with GSC.
es_co: Aprende más sobre las verificaciones de Google

source: Google Search Console verification
es_co: Verificación de integracion con Google Search Console

source: Bing allows crawling and indexing for site discovery and instant indexing for content.
es_co: Bing permite el rastreo, la indexación y el descubrimiento instantáneo del contenido de su sitio web en su motor de busqueda.

source: Congratulations! Your site is verified with Bing Webmaster Tools.
es_co: ¡Felicidades! Tu sitio cuenta con verificación en Bing Webmaster Tools

source: Your site doesn't have Bing Webmaster Tools.
es_co: No se encontró validación para Bing Webmaster Tools

source: https://osdeibi.dev/wp-plugin/en/site-validator/#bing
es_co: https://osdeibi.dev/wp-plugin/es/validador-de-sitio/#bing

source: Learn more about Bing webmaster tools for SEO
es_co: Aprende más sobre las verificaciones en Bing

source: Yandex offers tools to crawl and analyze your site, track search behavior, and provide a site health report.
es_co: Yandex ofrece herramientas para rastrear y analizar la indexación de páginas del sitio, la clasificación de búsqueda y el estado técnico.

source: Congratulations! Your site is verified with Yandex Webmaster.
es_co: ¡Felicidades! Tu sitio cuenta con verificación en Yandex Webmaster

source: Your site doesn't have Yandex verification.
es_co: No se encontró validación para Yandex

source: https://osdeibi.dev/wp-plugin/en/site-validator/#yandex
es_co: https://osdeibi.dev/wp-plugin/es/validador-de-sitio/#yandex

source: Learn more about Yandex Webmaster site verification
es_co: Aprende más sobre las verificaciones en Yandex

source: Yandex Webmaster verification
es_co: Verificación de Yandex Webmaster

source: Robot specifications.
es_co: Directivas de robots

source: https://osdeibi.dev/wp-plugin/en/seo-meta-tags/#robots
es_co: https://osdeibi.dev/wp-plugin/es/etiquetas-meta/#robots

source: Your site is not visible to search engines.
es_co: Tu sitio está oculto para los robots rastreadores

source: Learn more about robots and indexing.
es_co: Aprende más sobre los robots y rastreadores.

source: Configuration not found.
es_co: No se encontró la configuración

source: Learn more about robots.
es_co: Aprende más sobre los robots y rastreadores.

source: You can change the option
es_co: Puedes cambiar la opción

source: in
es_co: en

source: Reading Settings
es_co: Configuración de Lectura

source: to allow robots to index your site
es_co: y asi permitir el rastreo.

source: SEO Title
es_co: Titulo SEO

source: Your title length is beyond 60 characters, and maybe not all the content will be visible in search results.
es_co: Sobrepasa el límite de 60 caracteres y posiblemente no sea visible completamente en los resultados de búsqueda.

source: Great job! You have a nice title for your page.
es_co: Excelente, tienes un título para tu página principal

source: There is no title on your website.
es_co: No se encontró ningún título para la página principal

source: https://osdeibi.dev/wp-plugin/en/seo-meta-tags/#title
es_co: https://osdeibi.dev/wp-plugin/es/etiquetas-meta/#titulo

source: Learn more about SEO title
es_co: Aprende más sobre los títulos y el SEO

source: Meta Description
es_co: Descripción SEO

source: Your description length is beyond 170 characters, and maybe not all the content will be visible in search results.
es_co: Sobrepasa el límite de 170 caracteres y posiblemente no sea visible completo en los resultados de búsqueda.

source: Great job! You have a meta description for your homepage.
es_co: Excelente, tienes una descripción para tu página principal

source: There is no meta description for the homepage.
es_co: No se encontró ningúna descripción para la página principal

source: https://osdeibi.dev/wp-plugin/en/seo-meta-tags/#description
es_co: https://osdeibi.dev/wp-plugin/es/etiquetas-meta/#descripcion

source: Learn more about meta description for SEO
es_co: Aprende más sobre las descripciónes y SEO

source: You don't have keywords on your homepage.
es_co: No tienes palabras claves asignadas para tu página principal.

source: https://osdeibi.dev/wp-plugin/en/seo-meta-tags/#keywords
es_co: https://osdeibi.dev/wp-plugin/es/etiquetas-meta/#keywords

source: Learn more about keywords for SEO
es_co: Aprende más sobre la importancia de las palabras claves

source: There is more than one script for Analytics. You should merge them or only have one, as Google documentation says.
es_co: Hay mas de 1 script de Google Analytics 4: Solo deberias tener 1 por recomendacion de Google.

source: Great job! Your site has GA4 installed.
es_co: ¡Felicidades! Tu sitio web cuenta con GA4

source: Your site doesnt have Google Analytics installed.
es_co: Tu sitio web no cuenta con GA4

source: https://osdeibi.dev/wp-plugin/es/seo-analytics/#ga4
es_co: https://osdeibi.dev/wp-plugin/es/analitica-y-seo/#ga4

source: Learn more about Google Analytics and its importance for your website.
es_co: Aprende más sobre la importancia de Google Analytics para una web

source: Minified JavaScript
es_co: Minificado JS

source: Great job! Your site has all your JavaScript files minified.
es_co: Excelente, tienes todos tus archivos JavaScript minificados

source: JavaScript minified
es_co: Archivos Javascript minificados en total

source: JavaScript without minification
es_co: Archivos Javascript sin minificar

source: You should consider minifying all your JavaScript files.
es_co: Deberias considerar minificar todos tus archivos Javascripts

source: View JavaScript files without minification.
es_co: Ver archivos JavaScript sin minificar

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#js
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#js

source: Learn more about minification and JavaScript.
es_co: Aprende más sobre la importancia de los archivos JavaScript minificados

source: There are no minified JavaScript files.
es_co: No existen archivos JavaScript minificados

source: Learn more about the benefits of minified JavaScript.
es_co: Aprende más sobre la importancia de los archivos JavaScript minificados
