Repository: common-repository/bucky-seo-tools
Catalog: languages/bucky-seo-*.po
Languages: es_co

source: JavaScript files without minification.
es_co: Archivos JavaScript sin minificar

source: There are no JavaScript files.
es_co: No hay archivos JavaScript sin minificar

source: Close
es_co: Cerrar

source: WordPress by default minifies the core JavaScript files. However, some themes and plugins do not do it by default.
es_co: Los archivos del core de Wordpress por defecto vienen minificados. Algunos temas y plugins no los traen minificados por defecto.

source: Great job! Your site has all your CSS files minified.
es_co: Excelente, tienes todos tus archivos CSS minificados

source: CSS without minification
es_co: Archivos CSS sin minificar

source: You should consider minifying all your CSS files.
es_co: Deberias considerar minificar todos tus archivos CSS

source: View CSS files without minification.
es_co: Ver archivos CSS sin minificar

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#css
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#css

source: Learn more about minification and CSS.
es_co: Aprende más sobre la importancia de los archivos CSS minificados

source: There are no minified CSS files.
es_co: No existen archivos CSS minificados

source: Learn more about the benefits of minified CSS.
es_co: Aprende más sobre la importancia de los archivos CSS minificados

source: CSS files without minification.
es_co: Archivos CSS sin minificar

source: There are no CSS files.
es_co: No hay archivos CSS sin minificar

source: WordPress by default minifies the core CSS files. However, some themes and plugins don't do it by default.
es_co: Los archivos del core de Wordpress por defecto vienen minificados. Algunos temas y plugins no los traen minificados por defecto.

source: Great job! Your site has enabled Gzip compression.
es_co: ¡Felicidades! Tu sitio cuenta con compresión gzip habilitado.

source: It seems that your site doesn't have Gzip compression enabled.
es_co: Al parecer tu sitio no cuenta con compresión Gzip.

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#gzip
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#gzip

source: Learn how Gzip can make your site faster.
es_co: Aprende más sobre la compresión Gzip y su beneficio para el SEO

source: Gzip compression is the most popular because it has greater compatibility with the most commonly used browsers.
es_co: La compresión Gzip es la más usada por ser compatible con la mayoría de navegadores.

source: Show Iframes
es_co: Ver iframes

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#iframes
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#iframes

source: Learn more about how iframes can affect your site.
es_co: Aprende más sobre el uso de iframes y SEO

source: There are no iframes on your homepage.
es_co: No se encontraron iframes en la página.

source: Iframes list
es_co: Iframes encontrados

source: No Iframes to show
es_co: No hay iframes para mostrar.

source: iFrames don't affect SEO as much as you might think. Google still advises that you only use them when absolutely necessary.
es_co: Google recomienda evitar el uso de iframes en la medida de lo posible.

source: Great job! Your site has Cloudflare.
es_co: ¡Felicidades! Tu sitio cuenta con Cloudflare.

source: It seems that your website doesn't have Cloudflare.
es_co: Al parecer tu sitio no tiene configurado Cloudflare.

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#cloudflare
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#cloudflare

source: Learn more about Cloudflare and how it can improve your website.
es_co: Aprende más sobre Cloudflare y Wordpress

source: Cloudflare has its own plugin for WordPress.
es_co: Cloudflare tiene su plugin oficial para integrar con Wordpress.

source: Learn about the benefits of combining Cloudflare with WordPress.
es_co: Aprende más sobre los beneficios de Cloudflare para el SEO y WordPress.

source: Next-gen image formats
es_co: Imágenes de nueva generación

source: You have WebP images, but also have some images in other formats, like jpg, jpeg, or png.
es_co: Tienes imágenes en formato webp, pero también hay imágenes en otros formatos como jpg, jpeg y/o png.

source: https://osdeibi.dev/wp-plugin/en/technical-seo/#nextgen
es_co: https://osdeibi.dev/wp-plugin/es/seo-tecnico/#webp

source: You should consider converting your images to WebP.
es_co: Deberías considerar convertir tus imágenes jpg, jpeg y/o png a webp

source: Great job! You have WebP images
es_co: ¡Felicidades! Tienes imágenes en formato WebP.

source: Your website doesn't seem to be using WebP images. Consider using them for faster loading times.
es_co: Tu sitio web no cuenta con imágenes en formato webp.

source: JPG images
es_co: Imagenes de formato jpg

source: View JPG images
es_co: Ver imagenes jpg

source: JPEG images
es_co: Imagenes de formato jpeg

source: View JPEG images
es_co: Ver imagenes jpeg

source: PNG images
es_co: Imagenes de formato png

source: View PNG images
es_co: Ver imagenes png

source: JPG images found
es_co: Imagenes JPG encontradas

source: JPG images not found
es_co: Imagenes JPG no encontradas

source: JPEG images found
es_co: Imagenes JPEG encontradas

source: JPEG images not found
es_co: Imagenes JPGE no encontradas

source: PNG images found
es_co: Imagenes PNG encontradas

source: PNG images not found
es_co: Imagenes PNG no encontradas

source: Each format has its own use and purpose.
es_co: Cada formato de imagen tiene un uso específico.

source: Learn more about images and their purpose.
es_co: Aprende más sobre el uso de imagenes

source: Content
es_co: Contenidos

source: Great job! you have
es_co: ¡Felicidades! Tienes

source: Types of structured data.
es_co: tipos de datos estructurados en tu sitio web.

source: Check structured data
es_co: Ver datos estructurados

source: Your website doesn't have structured data.
es_co: Tu sitio web no cuenta con datos estructurados.

source: https://osdeibi.dev/wp-plugin/en/seo-content/#structured
es_co: https://osdeibi.dev/wp-plugin/es/contenido-seo/#datos

source: Don't know what type of structured data to choose?
es_co: ¿No sabes qué tipo de Dato Estructurado usar?

source: Structured data found
es_co: Datos estructurados encontrados

source: Structured data not found
es_co: No hay datos estrucutrados para mostrar.

source: JSON-LD is the recommended format for structured data
es_co: El formato recomendado para los datos estructurados es LD-JSON.

source: Learn more about the importance of structured data.
es_co: Aprende más sobre la importancia de los datos estructurados para una página web.

source: Hreflang found.
es_co: Enlaces Hreflang en la página

source: Check Hreflang
es_co: Ver enlaces hreflang

source: Hreflang not found.
es_co: No se encontraron enlaces hreflang en la página.

source: Hreflang found
es_co: Enlaces hreflang encontrados

source: Hreflang not available
es_co: No hay enlaces hreflang para mostrar.

source: Hreflang tags should be used on websites that have different languages and regions to indicate the appropriate version for users.
es_co: Hreflang se debe usar en cualquier sitio web que tenga múltiples versiones de páginas en diferentes idiomas o regiones.

source: https://osdeibi.dev/wp-plugin/en/seo-content/#int
es_co: https://osdeibi.dev/wp-plugin/es/contenido-seo/#internacional

source: Learn more about internationalization.
es_co: Aprende más sobre el uso de enlaces hreflang e internacionalización

source: H1 tags
es_co: Titulos H1

source: View H1 tags
es_co: titulos H1 en la página

source: H1 tags found
es_co: Ver titulos H1

source: Not tags found
es_co: No se encontraron etiquetas H1 en la página.

source: There are a lot of myths around H1 tags, like using more than one can negatively impact SEO.
es_co: Tener muchas H1 no daña el SEO, pero es una mala práctica tenerlas repetidas.

source: https://osdeibi.dev/wp-plugin/en/seo-content/#h1
es_co: https://osdeibi.dev/wp-plugin/es/contenido-seo/#titulos

source: Learn about H1 tags for SEO and accessibility
es_co: Aprende más sobre el uso de etiquetas H1

source: Canonical tag
es_co: Etiqueta Canonical

source: Total of canonical tags
es_co: Enlaces canonical en la página

source: Check canonical tags
es_co: Ver enlaces canonical

source: Canonical tags found
es_co: Enlaces canonical en la página.

source: Google just indexes one version of the duplicated content in search results
es_co: Google solo indexa una versión del contenido duplicado en los resultados de búsqueda.

source: https://osdeibi.dev/wp-plugin/en/seo-content/#canonical
es_co: https://osdeibi.dev/wp-plugin/es/contenido-seo/#canonical

source: Learn more about canonical tags
es_co: Aprende más sobre el uso de enlaces canónicos y SEO.

source: Great job! Your site have a right viewport configuration.
es_co: ¡Felicidades! Tu sitio cuenta con configuracion de viewport

source: Viewport content
es_co: Contenido del viewport

source: Viewport not found.
es_co: No se encontró contenido de viewport

source: https://osdeibi.dev/wp-plugin/en/seo-mobile/#viewport
es_co: https://osdeibi.dev/wp-plugin/es/seo-para-sitios-movil/#viewport

source: Learn more about viewport and responsive behavior
es_co: Aprende más sobre viewport y comportamientos responsivos.

source: Viewport uses HTML5 tags to indicate the size of the visible area
es_co: El viewport es una etiqueta meta de HTML5 que indica el tamaño de la ventana o área visible

source: AMP version founds
es_co: Versiones AMP en la página

source: View AMP versions
es_co: Ver versiones AMP

source: AMP pages not found.
es_co: No se encontraron paginas AMP

source: AMP links
es_co: Enlaces AMP

source: Not AMP to show
es_co: No hay AMP para mostrar

source: AMP means Accelerated Mobile Pages
es_co: Las siglas AMP provienen del término Accelerated Mobile Pages.

source: https://osdeibi.dev/wp-plugin/en/seo-mobile/#amp
es_co: https://osdeibi.dev/wp-plugin/es/seo-para-sitios-movil/#amp

source: Learn more about AMP pages
es_co: Aprende sobre los beneficios de páginas AMP.

source: Wordpress Analysis
es_co: Análisis de WordPress

source: Your website has an active SSL certificate.
es_co: Tu sitio cuenta con certificado SSL activo y HTTPS activado.

source: Your website does not have an active SSL certificate, so HTTPS is not available.
es_co: Tu sitio NO cuenta con certificado SSL activo y HTTPS activado.

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#https
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#https

source: An SSL certificate can help improve your website's SEO
es_co: Un certificado SSL es necesario para tu sitio web y para el SEO.

source: Most recent version
es_co: Versión mas reciente de WordPress

source: Your Wordpress version is up to date.
es_co: Su versión de WordPress está actualizada.

source: Your Wordpress version is not up to date
es_co: Su versión de WordPress no está actualizada.

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#version
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#version

source: Learn about how your Wordpress version can affect your performance on SEO
es_co: Aprende más sobre cómo tu versión de WordPress puede afectar tu sitio y SEO.

source: Total size of the installation
es_co: Tamaño total de la instalación

source: Size on MB
es_co: Peso total de la instalación de WordPress

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#installation
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#instalacion

source: Discover how the size of your WordPress installation can negatively affect your website's SEO
es_co: Aprende más sobre cómo la instalación de WordPress y su tamaño pueden afectar tu sitio y SEO.

source: Your active theme
es_co: Tema activo

source: No active theme
es_co: No hay tema activo

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#themes
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#tema

source: How can your website theme choice affect your SEO?
es_co: ¿Un tema puede afectar tu SEO?

source: No active plugins
es_co: No hay plugins activos.

source: View inactive plugins
es_co: Ver plugins inactivos

source: Inactive plugins found
es_co: Plugins inactivos encontrados

source: No inactive plugins to show
es_co: No hay plugins inactivos que mostrar.

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#plugins
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#plugins

source: While inactive plugins generally don't slow down your site, they can still affect your site security and SEO.
es_co: Los plugins inactivos pueden ser perjudiciales para tu sitio y el SEO.

source: Not defined and not found
es_co: La estructura de enlaces permanentes no está definida.

source: https://osdeibi.dev/wp-plugin/en/wordpress-seo-analysis/#permalinks
es_co: https://osdeibi.dev/wp-plugin/es/analisis-seo-wordpress/#permalinks

source: Learn how a good permalink strucutre can improve your SEO
es_co: Aprende más sobre cómo una buena estructura en tus URLs puede mejorar tu SEO.

source: Search...
es_co: Buscar...

source: Filter panel
es_co: Panel de opciones

source: SEO title
es_co: Titulo SEO

source: Meta description
es_co: Descripción SEO

source: JS Minify
es_co: Minificacion JS

source: CSS Minify
es_co: Minificacion CSS

source: WebP Images
es_co: Imagenes WebP

source: Wordpress installation
es_co: Instalacion WordPress

source: Select all
es_co: Marcar Todos

source: Deselect all
es_co: Desmarcar Todos

source: Save filters
es_co: Guardar filtros

source: Report a bug
es_co: Reportar bugs
